---
title: EnergyAnalysisConstruction
classe: Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# EnergyAnalysisConstruction

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Absorptance { get; }` | `energyAnalysisConstruction.Absorptance` | Double |
| `String ConstructionName { get; }` | `energyAnalysisConstruction.ConstructionName` | String |
| `String Description { get; }` | `energyAnalysisConstruction.Description` | String |
| `Double HeatTransferCoefficient { get; }` | `energyAnalysisConstruction.HeatTransferCoefficient` | Double |
| `Boolean IsSchematic { get; }` | `energyAnalysisConstruction.IsSchematic` | Boolean |
| `Int32 Roughness { get; }` | `energyAnalysisConstruction.Roughness` | Int32 |
| `Double ThermalMass { get; }` | `energyAnalysisConstruction.ThermalMass` | Double |
| `Double ThermalResistance { get; }` | `energyAnalysisConstruction.ThermalResistance` | Double |
| `IList<ElementId> GetMaterialIds()` | `energyAnalysisConstruction.GetMaterialIds()` | IList<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```